1033087886/esp32-cam/src/main.cpp
  int end = start;
  while (end < (int)json.length() &&
         json[end] != ',' &&
         json[end] != '}' &&
         !isspace((unsigned char)json[end])) {
    end++;
  }
  return json.substring(start, end);
}

String decodeCommandPayload(byte* payload, unsigned int length) {
  String raw;
  raw.reserve(length + 1);
  for (unsigned int i = 0; i < length; i++) {
    raw += static_cast<char>(payload[i]);
  }
  raw.trim();

  if (!raw.startsWith("{")) {
    return raw;
  }

  String v = extractJsonValue(raw, "light");
  if (v.length() > 0) return v;

  v = extractJsonValue(raw, "msg");
  if (v.length() > 0) return v;

  return raw;
}

bool parseBrightnessCommand(String cmd, uint8_t& outValue) {
  cmd.trim();
  cmd.toLowerCase();

  if (cmd == "on" || cmd == "led/on" || cmd == "1") {
    outValue = 255;
    return true;
  }

  if (cmd == "off" || cmd == "led/off" || cmd == "0") {
    outValue = 0;
    return true;
  }

  char* endPtr = nullptr;
  long value = strtol(cmd.c_str(), &endPtr, 10);
  if (*endPtr != '\0') {
    return false;
  }

  if (value < 0) value = 0;
  if (value > 255) value = 255;
  outValue = static_cast<uint8_t>(value);
  return true;
}

void mqttCallback(char* topic, byte* payload, unsigned int length) {
  String cmd = decodeCommandPayload(payload, length);
  String cmdLower = cmd;
  cmdLower.toLowerCase();

  Serial.printf("[MQTT] 收到消息 topic=%s payload=%s\n", topic, cmd.c_str());

  if (strcmp(topic, topicCmdLight.c_str()) != 0) {
    return;
  }

  if (cmdLower == "ping") {
    publishAck("pong");
    return;
  }

  if (cmdLower == "auth") {
    doPortalAuth();
    publishAck("portal-auth-done");
    return;
  }

  if (cmdLower == "status" || cmdLower == "light/status") {
    publishLightState();
    publishAck("light-status");
    return;
  }

  if (cmdLower == "toggle" || cmdLower == "light/toggle") {
    setFlashBrightness(currentLight > 0 ? 0 : 255, true);
    publishAck("light-toggle");
    return;
  }

  uint8_t nextValue = 0;
  if (parseBrightnessCommand(cmd, nextValue)) {
    setFlashBrightness(nextValue, true);
    publishAck("light-updated");
  } else {
    publishAck("unknown-cmd");
    Serial.println("[MQTT] 无效亮度命令，请用 0-255/on/off/toggle");
  }
}

bool initCamera() {
  camera_config_t config;
  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer = LEDC_TIMER_0;
  config.pin_d0 = Y2_GPIO_NUM;
  config.pin_d1 = Y3_GPIO_NUM;
  config.pin_d2 = Y4_GPIO_NUM;
  config.pin_d3 = Y5_GPIO_NUM;
  config.pin_d4 = Y6_GPIO_NUM;
  config.pin_d5 = Y7_GPIO_NUM;
  config.pin_d6 = Y8_GPIO_NUM;
  config.pin_d7 = Y9_GPIO_NUM;
  config.pin_xclk = XCLK_GPIO_NUM;
  config.pin_pclk = PCLK_GPIO_NUM;
  config.pin_vsync = VSYNC_GPIO_NUM;
  config.pin_href = HREF_GPIO_NUM;
  config.pin_sccb_sda = SIOD_GPIO_NUM;
  config.pin_sccb_scl = SIOC_GPIO_NUM;
  config.pin_pwdn = PWDN_GPIO_NUM;
  config.pin_reset = RESET_GPIO_NUM;
  config.xclk_freq_hz = 20000000;
  config.pixel_format = PIXFORMAT_JPEG;

  if (psramFound()) {
    config.frame_size = streamFrameSizePsram;
    config.jpeg_quality = streamJpegQualityPsram;
    config.fb_count = 3;
  } else {
    config.frame_size = streamFrameSizeNoPsram;
    config.jpeg_quality = streamJpegQualityNoPsram;
    config.fb_count = 1;
  }

#if defined(CAMERA_GRAB_LATEST)
  config.grab_mode = CAMERA_GRAB_LATEST;
#endif
#if defined(CAMERA_FB_IN_PSRAM)
  config.fb_location = CAMERA_FB_IN_PSRAM;
#endif

  esp_err_t err = esp_camera_init(&config);
  if (err != ESP_OK) {
    Serial.printf("[CAM] 初始化失败: 0x%x\n", err);
    return false;
  }

  currentJpegQuality = static_cast<uint8_t>(config.jpeg_quality);
  sensor_t* sensor = esp_camera_sensor_get();
  if (sensor) {
    const uint16_t sensorPid = sensor->id.PID;
#if defined(OV2640_PID)
    const bool isOv2640 = (sensorPid == OV2640_PID);
#else
    const bool isOv2640 = false;
#endif
#if defined(OV3660_PID)
    const bool isOv3660 = (sensorPid == OV3660_PID);
#else
    const bool isOv3660 = false;
#endif

    if (isOv2640) {
      Serial.printf("[CAM] 检测到 OV2640 (PID=0x%04x)\n", sensorPid);
    } else if (isOv3660) {
      Serial.printf("[CAM] 检测到 OV3660 (PID=0x%04x)\n", sensorPid);
    } else {
      Serial.printf("[CAM] 检测到未知传感器 PID=0x%04x\n", sensorPid);
    }

    sensor->set_quality(sensor, currentJpegQuality);
    sensor->set_contrast(sensor, 2);
    sensor->set_sharpness(sensor, 2);
    sensor->set_denoise(sensor, 0);
    sensor->set_gainceiling(sensor, GAINCEILING_8X);
    sensor->set_aec2(sensor, 1);
    sensor->set_dcw(sensor, 0);
    sensor->set_lenc(sensor, 1);
    sensor->set_brightness(sensor, 0);
    sensor->set_saturation(sensor, 0);

    if (isOv3660) {
      sensor->set_vflip(sensor, 1);
      sensor->set_hmirror(sensor, 0);
      sensor->set_brightness(sensor, 1);
      sensor->set_saturation(sensor, -1);
      Serial.println("[CAM] 已应用 OV3660 调优参数");
    }
  }

  Serial.printf(
    "[CAM] 初始化成功 frame=%d quality=%d fb_count=%d\n",
    static_cast<int>(config.frame_size),
    config.jpeg_quality,
    config.fb_count
  );
  return true;
}

void connectStreamWs() {
  if (wsClient.available() || WiFi.status() != WL_CONNECTED) return;

  wsReconnectCount++;
  Serial.println("[WS] 正在连接推流端点: " + String(streamWsUrl));
  Serial.printf("[WS] 重连次数: %lu\n", wsReconnectCount);
  Serial.printf("[WS] 连接前可用堆内存: %u\n", ESP.getFreeHeap());

  if (!wsClient.connect(streamWsHost, streamWsPort, streamWsPath)) {
    wsConnected = false;
    Serial.println("[WS] 连接失败");
    Serial.printf("[WS] 连接失败后可用堆内存: %u\n", ESP.getFreeHeap());
  }
}

void sendStreamFrameIfReady() {
  if (!wsClient.available() || !wsConnected) return;

  unsigned long now = millis();
  if (now - lastFrameTime < streamInterval) return;
  if (now - wsConnectedAt < streamSendWarmupMs) return;
  if (lastStreamStatTime == 0) {
    lastStreamStatTime = now;
  }

  unsigned long captureStart = millis();
  camera_fb_t* fb = esp_camera_fb_get();
  if (!fb) {
    Serial.println("[CAM] 抓帧失败");
    return;
  }
  unsigned long captureMs = millis() - captureStart;
  size_t frameBytes = fb->len;

